SEGUROS/WSDL/mprobci_Anulacion/wsAnulacionSoap12.wmImed_SrvAnulacion.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="http://tempuri.org/wsAnulacionSoap"
 xmlns:ns1="http://tempuri.org/"
 xmlns:ns3="http://tempuri.org/wsAnulacionSoap12">
 <SOAP-ENV:Body>
   <ns1:wmImed_SrvAnulacion>
    <ns1:XML_INPUT></ns1:XML_INPUT>
   </ns1:wmImed_SrvAnulacion>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
